import db from '../lib/database.js'

let handler = async (m, { conn, text, mentionedJid }) => {
  if (!mentionedJid.length) {
    return m.reply('منشن الشخص اللي عايز تشقطو!')
  }

  let user = mentionedJid[0] ? await conn.getName(mentionedJid[0]) : 'الشخص ده';
  let hasil = Math.floor(Math.random() * 5000)

  m.reply(`
❥ *"${pickRandom(global.piropo)}"*\n\n\t- 𝙎𝙖𝙛𝙧𝙤𝙩-𝘽𝙤𝙩
`, mentionedJid[0], { mentions: [mentionedJid[0]] })
}

handler.tags = ['fun']
handler.command = ['شقط']

export default handler

function msToTime(duration) {
  var milliseconds = parseInt((duration % 1000) / 100),
    seconds = Math.floor((duration / 1000) % 60),
    minutes = Math.floor((duration / (1000 * 60)) % 60),
    hours = Math.floor((duration / (1000 * 60 * 60)) % 24)

  hours = (hours < 10) ? "0" + hours : hours
  minutes = (minutes < 10) ? "0" + minutes : minutes
  seconds = (seconds < 10) ? "0" + seconds : seconds

  return minutes + " دق " + seconds + " ث"
}

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

global.piropo = ["لو جسمك كان سجن و شفايفك كانت سلسلة، يا لهوي إيه المكان الجميل ده اللي ممكن أقضي فيه عقوبتي.", "إنتي جمالك مش بس شكلك حلو، كمان دمك خفيف!", "شوفي العلم وصل لفين، دلوقتي بقى فيه بونبون متحرك.", "عشان القمر أديكي بوسة، أديكي روحي عشان الشمس، بس عشان ضوء عنيكي، هديكي قلبي و روحي.", "لو كنتي مطار و أنا طيارة، كنت هفضل أنزل على جسمك الجميل طول الوقت.", "قد إيه فيه نجوم في السما و ولا واحدة فيهم بتنور زيك.", "بحب القهوة، بس أنا بفضلك أكتر.", "إنتي مش جوجل، بس عندك كل اللي بدور عليه.", "مشاعري ناحيتك مش بتختفي، بالعكس بتزيد.", "بهديكي الوردة دي، رغم إن ولا وردة هتكون أحلى منك.", "لو عاقبوك عشان جمالك الزيادة، أنا اللي هادفع الغرامة.", "لو كل نقطة ميه نزلت على جسمك كانت بوسة، كنت أحب أبقى مطر.", "إنتي تستاهلي أدعيكي تنامي، و مش هننام.", "لو كان جسمك سجن و دراعاتك سلاسل، ده المكان المثالي اللي أعيش فيه.", "إزاي أحب أنام و إنتي قدامي على الشاشة؟", "نفسي أبقى نملة عشان أطلع عند بلكونتك و أهمسلك: يا حلوة، يا جميلة، يا بونبون.", "حياتي ناقصها حياة، حياتي ناقصها نور، حياتي ناقصها حد و الحد ده هو إنتي.", "يا مدام، لو كنت بعرف أعوم، كنت أرمي نفسي في بركة عنيكي من فوق رمشك.", "يا آنسة معلش، بس هم بينادوك من العلبة... -أي علبة؟... -علبة البونبون اللي هربتي منها", "إنتي جميلة جدًا لدرجة إنك تستاهلي مليون بوسة و لو مش عجبوكي هتقبليهم مني.", "إنتي جميلة جدًا لدرجة إن ربنا ينزل على الأرض بس عشان يشوفك.", "إنتي زي كاميرا سوني! كل ما أبصلك مبتقدرش تمنع نفسك من الابتسام.", "في جزيرة صحراوية نفسي أكون فيها و بس نعيش على بوساتك.", "لو كنتي مطر شتا، كنت هقفل الشمسية عشان أحس بيكي على جسمي.", "بحبك قد كده، لدرجة إني حتى بحب أكون مسجون في شبكة سحرك.", "لو قرصتك هتزعلي، بس لو إنتي قرصتيني، هبقى فقت.", "مش بكلام ذهب ولا ياقوت، دي كلمات حب بنكتبها ليكي.", "بدعوك إنك تبقي مبسوطة، و أنا اللي هدفع.", "لما تمشي مش بتدوسي على الأرض، دي بتلاطفها.", "هنبقى حلوين سوا في كيك الزفاف.", "قد إيه فيه طرق للحياة و أنا بس عايش في عنيكي.", "إيه الرقم اللي أتصل بيه لو عايز أكون معاك طول العمر؟", "بحبك قد كده مش عارف أبدأ منين أقولك.", "الكل بياخد بالك على شكلك، بس أنا بحب قلبك.", "هاي لو بتحبي اللغات لما تحبي هعلمك لغتي.", "قوليلي بتمشي منين عشان أبوس الأرض اللي بتمشي عليه.", "جمالك بيبهرك عشان جاية من قلبك و بيتعكس في عينيكي.", "إنتي من الناس اللي بتخلي النجوم تنزل ع الأرض.", "لو حد قالك إنك حلوة بيكذبوا، إنتي مش بس حلوة إنتي جميلة جدًا.", "السماء زرقاء، الكريمة صفراء و عنيكي سوداء اللي مجننانا.", "لو كنت كولومبوس، كنت هسافر ليل نهار عشان أوصل لأعماق قلبك.", "عديت خمس شوارع، و ستة مع الحارة، باقيلي بس شارع عشان أوصل لقلبك.", "لو كنتي خطيبتي هبقى ملحد ليه؟ عشان مابقاش ليا حاجة أطلبها من ربنا.", "لو كانت بنت جميلة و مامتها موجودة: يا جمال الفل، ياريت لو مكنتش جايه مع القصعة!", "لو ابتسمتي هتبقي مش بس حلوة هتبقي مثالية.", "إيه اللي حصل في السما عشان الملائكة بيقعوا؟", "هديكي مخالفة ليه؟ عشان جمالك الزيادة.", "إزاي أهلك كانوا بيحبوا بعض... عشان يخلفوا واحدة جميلة زيك.", "ليه السماء غائمة؟ عشان كل الأزرق في عنيكي.", "إنتي جرحتِ نفسك يا حلوة؟ لازم تكوني اتعورتي لما وقعت من السما.", "عنيكي خضرا و عني عسلية، عني بتحبك و عنيكي لسه مش عارف.", "لما اليوم يظلم، مابشتاقش للشمس، عشان عندي ابتسامتك.", "واحدة ماشية و بتقول مع السلامة... -لله اللي شفته في عنيكي!", "في أماكن تانية في العالم الناس بيشتكوا، عشان الشمس هنا بس.", "استغلي الفرصة أنا عامل تخفيض و بديكي بوسة بواحدة بسعر اتنين. ربنا أتقن شغله لما خلقك.", "الحب و إنتي اتعرفتوا في نفس الوقت.", "لو كان الجمال وقت، إنتي هتبقي 24 ساعة.", "لو يوم ضيعتي نفسك، دوري عليكي في أفكاري!", "لو حبك كان خطيئة، يبقى جهنم مضمونة.", "إنتي الحاجة الوحيدة اللي ناقصاني عشان حياتي تبقى مثالية.", "إنتي النجم الوحيد اللي ناقص في سما حياتي!", "دلوقتي بعد ما عرفتك، مابقاش ليه حاجة تانية أطلبها من الدنيا!", "هضطر أخليكي تدفعي إيجار، عشان من ساعة ما شفتك مبطلتش تعيشي في أحلامي.", "نفسي أبقى المخدة بتاعتك،!"]
