let handler = async (m, { conn }) => {
  try {
    let message = `*𓆩『 الصراحة 』𓆪*\nꔹ━━━━━━━━ꔹ\n> *『${
    
    pickRandom(global.bjssvjs)
    
    }』*\nꔹ━━━ꔹꔹ━━━ꔹ`;
    conn.reply(m.chat, message, m);
  } catch (e) {
    conn.reply(m.chat, 'حصل خطأ أثناء جلب الصراحة. حاول مرة تانية.', m);
  }
}

handler.help = ['✓ ◡̈⃝ ✓│صراحة']
handler.tags = ['game']
handler.command = /صرحني|صراحه|الصراحة/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

global.bjssvjs = [
  "صراحة | صوتك حلو؟",
  "صراحة | قابلت حد بوشين قبل كده؟",
  "صراحة | إيه الحاجة اللي بتحاول تمسك نفسك عنها؟",
  "صراحة | بتحس إنك ضعيف إمتى؟",
  "صراحة | بتحب تظهر حبك لحد ولا بتشوفه ضعف؟",
  "صراحة | هل الكذب ضروري في بعض الأحيان؟",
  "صراحة | بتحس بالوحدة رغم إن حواليك ناس كتير؟",
  "صراحة | إزاي تعرف إن حد بيكدب عليك؟",
  "صراحة | لو حد مهتم بيك لكن انت مش بتحبه، هتديله فرصة؟",
  "صراحة | إيه أكتر حاجة شجاعة عملتها في حياتك؟",
  "صراحة | إزاي تقنع حد بفكرة حتى لو هي غلط؟",
  "صراحة | بتتصرف إزاي لو حد أساء فهمك؟",
  "صراحة | التغيير طبيعي لما الشخص بيحب؟",
  "صراحة | المواقف الصعبة بتقويك ولا بتكسرك؟",
  "صراحة | شايف إن النظرة ممكن تبوظ صداقة؟",
  "صراحة | لو حد قالك كلام سيء، إيه رد فعلك؟",
  "صراحة | مين الشخص اللي واقف معاك في الحلوة والمرة؟",
  "صراحة | بتحب تعبر عن حبك لحد ولا بتشوفه ضعف؟",
  "صراحة | بتسمع نصايح الناس ولا بتعمل اللي في دماغك؟",
  "صراحة | إيه الحاجة اللي تتمنى الناس تعرفها عنك؟",
  "صراحة | ممكن تبيع المجرة عشان؟",
  "صراحة | أحيانا بتحس إن الناس؟ كمل.",
  "صراحة | نفسك تنام جنب مين النهارده؟",
  "صراحة | صدفة عمرك الحلوة كانت إيه؟",
  "صراحة | بتتفق إن الكره الكبير بيجي بعد حب كبير؟",
  "صراحة | إيه أكتر صفة بتحبها في نفسك؟",
  "صراحة | بتتفق إن الفقر فقر عقول مش جيوب؟",
  "صراحة | بتصلي صلواتك الخمس؟",
  "صراحة | بتجامل الناس على حساب راحتك؟",
  "صراحة | إيه أكتر حاجة شجاعة عملتها في حياتك؟",
  "صراحة | إيه خطتك لليوم؟",
  "صراحة | بتحس بإيه لما تشوف المطر؟",
  "صراحة | غيرتك هادية ولا بتعمل مشاكل؟",
  "صراحة | إيه أكتر حاجة ندمان عليها؟",
  "صراحة | إيه الدولة اللي نفسك تزورها؟",
  "صراحة | آخر مرة عيطت كانت إمتى؟",
  "صراحة | تقييمك لحظك من 10؟",
  "صراحة | شايف حظك وحش؟",
  "صراحة | نفسك تنتقم من مين؟",
  "صراحة | إيه الكلمة اللي تحب تسمعها كل يوم؟",
  "صراحة | شاطر في شغلك ولا بتحس بالملل؟",
  "صراحة | عملت شخصية مزيفة عشان تكذب على الناس؟",
  "صراحة | آخر مرة عملت مشكلة كبيرة كانت إمتى؟",
  "صراحة | إيه أسوأ خبر سمعته في حياتك؟",
  "صراحة | هل جرحت حد بتحبه قبل كده؟",
  "صراحة | إيه العادة اللي نفسك تبطلها؟",
  "صراحة | بتحب عيلتك ولا بتكرههم؟",
  "صراحة | مين الشخص اللي في قلبك بعد ربنا ورسوله؟",
  "صراحة | خجلت من نفسك قبل كده؟",
  "صراحة | إيه الحلم اللي معرفتش تحققه؟",
  "صراحة | مين الشخص اللي بتحلم بيه كل يوم؟",
  "صراحة | حصل لك موقف محرج خلاك تكره صاحبه؟",
  "صراحة | عيطت قدام حد بتحبه؟",
  "صراحة | هتختار حبيبك ولا صاحبك؟",
  "صراحة | حياتك سعيدة ولا حزينة؟",
  "صراحة | إيه أجمل سنة عشتها في حياتك؟",
  "صراحة | إيه عمرك الحقيقي؟",
  "صراحة | إيه أكتر حاجة ندمان عليها؟",
  "صراحة | إيه أمنياتك المستقبلية؟",
  "صراحة | قبلت بنت قبل كده؟"
]