let handler = async (m, { conn }) => {
    conn.reply(m.chat, `> *\`『${pickRandom(global.lw)}』\`* \n\n> 𝐒𝐀𝐅𝐑𝐎𝐓-𝐁𝐎𝐓  `, m)
}
handler.help = ['bzmzjdks']
handler.tags = ['fun']
handler.command = ['لو']
export default handler

function pickRandom(list) {
    return list[Math.floor(list.length * Math.random())]
}

global.lw = [
    'لو خيروك تلبس ملابس الغوص وتروح بها الشغل يوم كامل أو تلبس هدوم جدتك.',
    'لو خيروك تصرخ في الشارع أو تصفع أول واحد تقابله.',
    'لو خيروك تاكل الشوكولاتة اللي بتحبها بس تضيف عليها رشة ملح مع شوية عصير ليمون، أو تاكل ليمونة كاملة.',
    'لو خيروك ترقص على السطح أو تغني وأنت واقف على الشباك.',
    'لو خيروك تحط لبانة على شعرك أو تأكل لبانة كانت في فم واحد تاني.',
    'لو خيروك تنظف شعرك بسائل غسيل الأطباق، أو تستخدم كريم الأساس عشان تغسل الأطباق.',
    'لو خيروك تحط وشك في الطحين أو تأكل فص ثوم.',
    'لو خيروك تلعب مع الأطفال لمدة طويلة أو تقعد لوحدك لمدة 24 ساعة من غير ما تعمل أي حاجة.',
    'لو خيروك تحلق شعرك كله أو تصبغه لون بنفسجي.',
    'لو خيروك تقص شعر أخوك وهو نايم أو تلبس هدوم أخوك الصغير وتخرج بيها.',
    'لو خيروك تضيف البرتقال لسلطة أو تضيف البطاطا لطبق الفاكهة.',
    'لو خيروك تاكل ثلج أو تشرب مية سخنة.',
    'لو خيروك تأكل قرن من الحد أو بصلة كاملة.',
    'لو خيروك تبقى شخص يحبه الكل أو يخشاه الكل.',
    'لو خيروك تعيش لوحدك على سطح القمر أو تعيش على سطح المريخ لوحدك.',
    'لو خيروك بين أمك وأبوك.',
    'لو خيروك تبقى مع حبيبتك مدى الحياة أو تبقى مع أختك.',
    'لو خيروك تسافر للمالديف رحلة سياحية بس تقدر تاخد معاك شخص واحد، هتاخد مين؟.',
    'لو خيروك تشتري هدية غالية لحد من عائلتك، هتعطيها لمين؟.',
    'لو خيروك بين الحب والفلوس، تختار إيه؟.',
    'لو خيروك تتجوز واحد بتحبه أو تتجوز الشخص اللي هيحقق لك أحلامك.',
    'لو خيروك تاخد مليون دولار، أو تفشي سر واحد من أصحابك.',
    'لو خيروك ترقص مع بنت قدام مراتك أو حبيبتك أو تلبس هدوم بنت.',
]